Rhino.Inside.Revit API
GeometryEncoder.ToPoint Method (PointCloudItem)
 Converts the specified PointCloudItem to an equivalent Revit Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Point ToPoint(
	this Rhino.Geometry.PointCloudItem value
)
@staticmethod
def ToPoint(
	value: Rhino.Geometry.PointCloudItem
) -> Autodesk.Revit.DB.Point
Parameters
value
Type: Rhino.Geometry.PointCloudItem
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Point
A Revit Point that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.PointCloudItem. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToPoint Overload
RhinoInside.Revit.Convert.Geometry Namespace